Repository: gnu-mirror-unofficial/sharutils
Catalog: po/*.po
Languages: sv

source: invalid compaction type: %s the known types are:
sv: ogiltig kompressionstyp: %s kända typer är:

source: files on command line and --input-file-list specified
sv: filer på kommandoraden och --input-file-list angivna

source: Created %d files
sv: Skapade %d filer

source: fs error %d (%s) %s-ing %s
sv: fs-fel %d (%s) %s-ar %s

source: standard input
sv: standard in

source: unshar usage error:
sv: unshar användningsfel:

source: unshar fatal error:
sv: unshar ödesdigert fel:

source: unshar (GNU sharutils) 4.15.2 Copyright (C) 1994-2015 Free Software Foundation, Inc., all rights reserved. This is free software. It is licensed for use, modification and redistribution under the terms of the GNU General Public License, version 3 or later <http://gnu.org/licenses/gpl.html>
sv: unshar (GNU sharutils) 4.15.2 Copyright © 1994-2015 Free Software Foundation, Inc., med ensamrätt. Detta är fri programvara. Den licensieras för användning, modifiering och återdistribution under villkoren för GNU General Public License, version 3 eller senare <http://gnu.org/licenses/gpl.html>

source: unshar is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
sv: unshar är fri programvara. Du kan återdistribuera det och/eller modifiera det under villkoren i GNU General Public License, publicerad av Free Software Foundation, antingen version 3 av licensen, eller (om du så vill) någon senare version.

source: unshar is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sv: unshar distribueras i hopp om att det ska vara användbart, men UTAN NÅGON SOM HELST GARANTI, även utan underförstådd garanti om SÄLJBARHET eller LÄMPLIGHET FÖR NÅGOT SPECIELLT ÄNDAMÅL. Se GNU General Public License för ytterligare information.

source: unshar (GNU sharutils) - unpack a shar archive Usage: %s [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...]
sv: unshar (GNU sharutils) - packa upp ett shar-arkiv Användning: %s [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…]

source: If no arguments are provided, input arguments are read from stdin, one per line; blank and '#'-prefixed lines are comments. 'stdin' may not be a terminal (tty).
sv: Om inga argument anges kommer indataargument att läsas från standard in, ett per rad; tomma rader och rader som prefixas med ”#” är kommentarer. ”stdin” får inte vara en terminal (tty).

source: Unshar scans the input files (typically email messages) looking for the start of a shell archive. If no files are given, then standard input is processed instead. It then passes each archive discovered through an invocation of the shell program to unpack it.
sv: Unshar letar genom indatafiler (typiskt e-postmeddelanden) efter början på ett skalarkiv. Om inga filer anges kommer standard in att behandlas istället. Det skickar sedan varje identifierat arkiv genom en körning av skalprogrammet för att packa upp det.

source: unshar (GNU sharutils) - unpack a shar archive Usage: unshar [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...]
sv: unshar (GNU sharutils) - packa upp ett shar-arkiv Användning: unshar [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…]

source: -d, --directory=DIR unpack into the directory DIR
sv: -d, --directory=KAT dekomprimera i katalogen KAT

source: -c, --overwrite overwrite any pre-existing files
sv: -c, --overwrite skriv över filer som redan existerar

source: -f, --force an alias for the 'overwrite' option
sv: -f, --force ett alias för flaggan ”overwrite”

source: -E, --split-at=SPLIT-PAT split input on SPLIT-PAT lines
sv: -E, --split-at=DELN-MÖNST dela indata på DELN-MÖNST-rader

source: -e, --exit-0 split input on "exit 0" lines - prohibits the option 'split-at'
sv: -e, --exit-0 dela indata på ”exit 0”-rader - förbjuder flaggan ”split-at”

source: -D, --debug debug the shell code
sv: -D, --debug felsök skalkoden

source: -R, --save-opts[=FILE] save the option state to the config file FILE
sv: -R, --save-opts[=FIL] spara flaggtillståndet till konfigurationsfilen FIL

source: -r, --load-opts=FILE load options from the config file FILE - disabled as '--no-load-opts' - may appear multiple times
sv: -r, --load-opts=FIL läs in flaggor från konfigurationsfilen FIL - inaktiveras som ”--no-load-opts” - får förekomma flera gånger

source: Options are specified by doubled hyphens and their name or by a single hyphen and the flag character.
sv: Flaggor anges med dubbla bindestreck och deras namn eller med ett enkelt bindestreck och flaggtecknet.

source: If no arguments are provided, input arguments are read from stdin, one per line; blank and '#'-prefixed lines are comments. 'stdin' may not be a terminal (tty).
sv: Om inga argument anges kommer indataargument att läsas från standard in, ett per rad; tomma rader och rader som prefixas med ”#” är kommentarer. ”stdin” får inte vara en terminal (tty).

source: - reading file $HOME/.sharrc 'unshar' scans the input files (typically email messages) looking for the start of a shell archive. If no files are given, then standard input is processed instead. It then passes each archive discovered through an invocation of the shell program to unpack it.
sv: - läser filen $HOME/.sharrc 'unshar' letar genom indatafilerna (typiskt e-postmeddelanden) och letar efter början på ett skalarkiv. Om inga filer anges kommer standard in att behandlas istället. Det skickar sedan varje hittat arkiv genom en körning av skalprogrammet för att packa upp det.

source: Please send bug reports to: <bug-gnu-utils@gnu.org>
sv: Skicka felrapporter till: <bug-gnu-utils@gnu.org> Skicka synpunkter på översättningen till: tp-sv@listor.tp-sv.org>

source: unshar (GNU sharutils) - unpack a shar archive Usage: unshar [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...] Try 'unshar --help' for more information.
sv: unshar (GNU sharutils) - packa upp ett shar-arkiv Användning: unshar [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…] Prova 'unshar --help' för vidare information.

source: could not allocate %zu bytes for %s
sv: kunde inte allokera %zu byte för %s

source: Found no shell commands after cut line in %s
sv: Hittade inga skalkommandon efter klipprad i %s

source: %s is probably not a shell archive
sv: %s är förmodligen inte ett skalarkiv

source: The 'cut line' was followed by: %s
sv: ”Klippraden” följdes av: %s

source: Found no shell commands in %s
sv: Hittade inga skalkommandon i %s

source: %s looks like raw C code, not a shell archive
sv: %s ser ut som C-kod, inte som ett skalarkiv

source: file name buffer
sv: filnamnsbuffert

source: read/write buffer
sv: läs-/skrivbuffert

source: uudecode usage error:
sv: uudecode användningsfel:

source: uudecode fatal error:
sv: uudecode ödesdigert fel:

source: uudecode (GNU sharutils) 4.15.2 Copyright (C) 1994-2015 Free Software Foundation, Inc., all rights reserved. This is free software. It is licensed for use, modification and redistribution under the terms of the GNU General Public License, version 3 or later <http://gnu.org/licenses/gpl.html>
sv: uudecode (GNU sharutils) 4.15.2 Copyright © 1994-2015 Free Software Foundation, Inc., med ensamrätt. Detta är fri programvara. Den licensieras för användning, modifiering och återdistribution under villkoren för GNU General Public License, version 3 eller senare <http://gnu.org/licenses/gpl.html>

source: uudecode is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
sv: uudecode är fri programvara. Du kan återdistribuera det och/eller modifiera det under villkoren i GNU General Public License, publicerad av Free Software Foundation, antingen version 3 av licensen, eller (om du så vill) någon senare version.

source: uudecode is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sv: uudecode distribueras i hopp om att det ska vara användbart, men UTAN NÅGON SOM HELST GARANTI, även utan underförstådd garanti om SÄLJBARHET eller LÄMPLIGHET FÖR NÅGOT SPECIELLT ÄNDAMÅL. Se GNU General Public License för ytterligare information.

source: uudecode (GNU sharutils) - decode an encoded file Usage: %s [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...]
sv: uudecode (GNU sharutils) - avkoda en kodad fil Användning: %s [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…]

source: If no 'file'(s) are provided, then standard input is decoded.
sv: Om inga ”filer” anges kommer standard in att avkodas.

source: 'uudecode' transforms uuencoded files into their original form.
sv: ”uudecode” transformerar filer kodade med uuencode till deras originalform.

source: The encoded file(s) may be specified on the command line, or one may be read from standard input. The output file name is specified in the encoded file, but may be overridden with the '-o' option. It will have the mode of the original file, except that setuid and execute bits are not retained. If the output file is specified to be '/dev/stdout' or '-', the result will be written to standard output. If there are multiple input files and the second or subsquent file specifies standard output, the decoded data will be written to the same file as the previous output. Don't do that.
sv: De kodade filerna kan anges på kommandoraden, eller så kan en läsas in från standard in. Utdatafilnamnet som anges i den kodade filen kan åsidosättas med flaggan ”-o”. Den kommer att få samma rättigheter som originalfilen, förutom att setuid- och exekveringsbitarna inte behålls. Om utdatafilen är angiven som ”/dev/stdout” eller ”-”, kommer resultatet att skrivas till standard ut. Om det finns flera indatafiler och den andra eller efterföljande filer anger standard ut kommer avkodad data att skrivas till samma fil som föregående utdata. Gör inte så.

source: 'uudecode' ignores any leading and trailing lines. It looks for a line that starts with "'begin'" and proceeds until the end-of-encoding marker is found. The program determines from the header line of the encoded file which of the two supported encoding schemes was used and whether or not the output file name has been encoded with base64 encoding. See 'uuencode(5)'.
sv: ”uudecode” hoppar över inledande och efterföljande rader. Det letar efter en rad som börjar med ”'begin'” och fortsätter tills markören slut-på-kodning hittas. Programmet avgör från rubrikraden i den kodade filen vilken av två kodningsmetoder som använts och huruvida utdatafilnamnet har kodats med base64-kodning. Se ”uuencode(5)”.

source: uudecode (GNU sharutils) - decode an encoded file Usage: uudecode [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...]
sv: uudecode (GNU sharutils) - avkoda en kodad fil Användning: uudecode [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…]

source: -o, --output-file=str direct output to file
sv: -o, --output-file=str utdata direkt till fil

source: -c, --ignore-chmod ignore fchmod(3P) errors
sv: -c, --ignore-chmod ignorera fel från fchmod(3P)

source: Options are specified by doubled hyphens and their name or by a single hyphen and the flag character. If no 'file'(s) are provided, then standard input is decoded.
sv: Flaggor anges med dubbla bindestreck och deras namn eller med ett enkelt bindestreck och flaggtecknet. Om inga ”filer” anges kommer standard in att avkodas.

source: - reading file $HOME/.sharrc 'uudecode' transforms uuencoded files into their original form.
sv: - läser filen $HOME/.sharrc 'uudecode' transformerar filer kodade av uuencode till deras originalform.

source: 'uudecode' ignores any leading and trailing lines. It looks for a line that starts with "'begin'" and proceeds until the end-of-encoding marker is found. The program determines from the header line of the encoded file which of the two supported encoding schemes was used and whether or not the output file name has been encoded with base64 encoding. See 'uuencode(5)'.
sv: ”uudecode” hoppar över inledande och efterföljande rader. Det letar efter en rad som börjar med ”'begin'” och fortsätter tills markören slut-på-kodning hittas. Programmet avgör från rubrikraden i den kodade filen vilken av två kodningsmetoder som använts och huruvida utdatafilnamnet har kodades med base64-kodning. Se ”uuencode(5)”.

source: uudecode (GNU sharutils) - decode an encoded file Usage: uudecode [ -<flag> [<val>] | --<name>[{=| }<val>] ]... [<file>...] Try 'uudecode --help' for more information.
sv: uudecode (GNU sharutils) - avkoda en kodad fil Användning: uudecode [ -<flagga> [<värde>] | --<namn>[{=| }<värde>] ]… [<fil>…] Prova ”uudecode --help” för vidare information.

source: %s: Short file
sv: %s: Stympad fil

source: %s: No `end' line
sv: %s: ”end”-rad saknas

source: %s: invalid input
sv: %s: ogiltig indata

source: cannot expand $HOME
sv: kan inte expandera $HOME

source: %s: Illegal file name: %s
sv: %s: Ogiltigt filnamn: %s

source: No user '%s'
sv: Ingen användare ”%s”

source: output file name
sv: utdatafilnamn

source: cannot access %s
sv: kan inte komma åt %s

source: chmod of %s
sv: åtkomständring (chmod) av %s

source: output name is empty
sv: utdatanamn är tomt

source: invalid base64 encoded name: %s
sv: ogiltigt base64-kodat namn: %s

source: %s: Invalid or missing 'begin' line
sv: %s: Ogiltig eller saknad ”begin”-rad

source: %s: Write error
sv: %s: Skrivfel

source: You cannot specify an output file when processing multiple input files.
sv: Du kan inte endast ange en enda utdatafil när flera indatafiler behandlas.

source: uuencode usage error:
sv: uuencode användningsfel:

source: uuencode fatal error:
sv: uuencode ödesdigert fel:

source: uuencode (GNU sharutils) 4.15.2 Copyright (C) 1994-2015 Free Software Foundation, Inc., all rights reserved. This is free software. It is licensed for use, modification and redistribution under the terms of the GNU General Public License, version 3 or later <http://gnu.org/licenses/gpl.html>
sv: uuencode (GNU sharutils) 4.15.2 Copyright © 1994-2015 Free Software Foundation, Inc., med ensamrätt. Detta är fri programvara. Den licensieras för användning, modifiering och återdistribution under villkoren för GNU General Public License, version 3 eller senare <http://gnu.org/licenses/gpl.html>

source: uuencode is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
sv: uuencode är fri programvara. Du kan återdistribuera det och/eller modifiera det under villkoren i GNU General Public License, publicerad av Free Software Foundation, antingen version 3 av licensen, eller (om du så vill) någon senare version.

source: uuencode is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sv: uuencode distribueras i hopp om att det ska vara användbart, men UTAN NÅGON SOM HELST GARANTI, även utan underförstådd garanti om SÄLJBARHET eller LÄMPLIGHET FÖR NÅGOT SPECIELLT ÄNDAMÅL. Se GNU General Public License för ytterligare information.

source: uuencode (GNU sharutils) - encode a file into email friendly text Usage: %s [ -<flag> | --<name> ]... [<in-file>] <output-name>
sv: uuencode (GNU sharutils) - koda en fil som e-postvänlig text Användning: %s [ -<flagga> | --<namn> ]… [<indatafil>] <utdatanamn>

source: 'uuencode' is used to create an ASCII representation of a file that can be sent over channels that may otherwise corrupt the data. Specifically, email cannot handle binary data and will often even insert a character when the six character sequence "\nFrom " is seen.
sv: ”uuencode” används för att skapa en ASCII-representation av en fil som kan skickas över kanaler som annars skulle ha förvrängt data. I synnerhet kan e-post inte hantera binärdata och kommer ofta att till och med infoga ett tecken när teckensekvensen ”\nFrom ” identifieras.

source: 'uuencode' will read 'in-file' if provided and otherwise read data from standard in and write the encoded form to standard out. The output will begin with a header line for use by 'uudecode' giving it the resulting suggested file 'output-name' and access mode. If the 'output-name' is specifically '/dev/stdout', then 'uudecode' will emit the decoded file to standard out.
sv: ”uuencode” kommer att läsa ”indatafil” om den anges och i annat fall läsa data från standard in och skriva kodad data på standard ut. Utdata kommer att börja med en rubrikrad för användning av ”uudecode” som anger föreslaget ”utdatanamn” och rättighetsläge. Om ”utdatanamn” är exakt ”/dev/stdout” kommer ”uudecode” att mata ut den avkodade filen till standard ut.

source: 'Note': 'uuencode' uses buffered input and assumes that it is not hand typed from a tty. The consequence is that at a tty, you may need to hit Ctl-D several times to terminate input.
sv: ”Not”: ”uuencode” använder buffrad indata och förutsätter att det inte skrivs in för hand från en tty. Konsekvensen är att för en tty kan du behöva trycka på Ctrl-D flera gånger för att avsluta inmatning.

source: uuencode (GNU sharutils) - encode a file into email friendly text Usage: uuencode [ -<flag> | --<name> ]... [<in-file>] <output-name>
sv: uuencode (GNU sharutils) - koda en fil till e-postvänlig text Användning: uuencode [ -<flagga> | --<namn> ]… [<indatafil>] <utdatanamn>

source: -m, --base64 convert using base64
sv: -m, --base64 konvertera via base64

source: -e, --encode-file-name encode the output file name
sv: -e, --encode-file-name koda utdatafilnamnet

source: - reading file $HOME/.sharrc 'uuencode' is used to create an ASCII representation of a file that can be sent over channels that may otherwise corrupt the data. Specifically, email cannot handle binary data and will often even insert a character when the six character sequence "\nFrom " is seen.
sv: - läser fil $HOME/.sharrc ”uuencode” används för att skapa en ASCII-representation av en fil som kan skickas över kanaler som annars skulle ha förvrängt data. I synnerhet kan e-post inte hantera binärdata och kommer ofta att till och med infoga ett tecken när teckensekvensen ”\nFrom ” identifieras.

source: 'Note': 'uuencode' uses buffered input and assumes that it is not hand typed from a tty. The consequence is that at a tty, you may need to hit Ctl-D several times to terminate input. Please send bug reports to: <bug-gnu-utils@gnu.org>
sv: ”Not”: ”uuencode” använder buffrad indata och förutsätter att det inte skrivs in för hand från en tty. Konsekvensen är att för en tty kan du behöva trycka på Ctrl-D flera gånger för att avsluta inmatning. Skicka felrapporter till: <bug-gnu-utils@gnu.org> Skicka synpunkter på översättningen till: <tp-sv@listor.tp-sv.se>

source: uuencode (GNU sharutils) - encode a file into email friendly text Usage: uuencode [ -<flag> | --<name> ]... [<in-file>] <output-name> Try 'uuencode --help' for more information.
sv: uuencode (GNU sharutils) - koda en fil till e-postvänlig text Användning: uuencode [ -<flagga> | --<namn> ]… [<indatafil>] <utdatanamn> Prova ”uuencode --help” för vidare information.

source: freopen of stdin
sv: kör freopen på standard in

source: file name
sv: filnamn

source: Unknown system error
sv: Okänt systemfel

source: %s: option '%s' is ambiguous; possibilities:
sv: %s: flaggan ”%s” är tvetydig; alternativ:

source: %s: option '%s' is ambiguous
sv: %s: flaggan ”%s” är tvetydig

source: %s: option '--%s' doesn't allow an argument
sv: %s: flaggan ”--%s” tar inget argument

source: %s: option '%c%s' doesn't allow an argument
sv: %s: flaggan ”%c%s” tar inget argument

source: %s: option '--%s' requires an argument
sv: %s: flaggan ”--%s” kräver ett argument

source: %s: unrecognized option '--%s'
sv: %s: okänd flagga ”--%s”

source: %s: unrecognized option '%c%s'
sv: %s: okänd flagga ”%c%s”

source: %s: invalid option -- '%c'
sv: %s: ogiltig flagga -- ”%c”

source: %s: option requires an argument -- '%c'
sv: %s: flaggan behöver ett argument -- ”%c”

source: %s: option '-W %s' is ambiguous
sv: %s: flaggan ”-W %s” är tvetydig

source: %s: option '-W %s' doesn't allow an argument
sv: %s: flaggan ”-W %s” tar inget argument

source: %s: option '-W %s' requires an argument
sv: %s: flaggan ”-W %s” kräver ett argument

source: unable to record current working directory
sv: misslyckades med att spara nuvarande katalog

source: failed to return to initial working directory
sv: misslyckades med att återvända till ursprunglig katalog

source: cannot create pipe
sv: kan inte skapa rör

source: %s subprocess failed
sv: %s underprocess misslyckades

source: _open_osfhandle failed
sv: _open_osfhandle misslyckades

source: cannot restore fd %d: dup2 failed
sv: kan inte återställa fd %d: dup2 misslyckades

source: %s subprocess
sv: %s underprocess

source: %s subprocess got fatal signal %d
sv: %s underprocess fick ödesdiger signal %d

source: memory exhausted
sv: minnet slut

source: invalid %s%s argument '%s'
sv: ogiltigt %s%s-argument ”%s”

source: invalid suffix in %s%s argument '%s'
sv: ogiltigt suffix i %s%s-argument ”%s”

source: %s%s argument '%s' too large
sv: %s%s-argument ”%s” för stort
